#+TITLE: Jekyll and Org together
#+LAYOUT: post
#+Author: Miguel Rodrigues



This is a blog post about Jekyll and Org mode.

** org-table demo 

   | a | b | c | d | e |
   |---+---+---+---+---|
   | 1 | 2 | 3 | 4 | 5 |


   
** Code highlighting
   Jekyll-org also offers powerful support for code snippets:
   #+begin_src  ruby :results output 
     def print_hi(name)
       puts "Hi, #{name}"
     end
     print_hi('Tom')

   #+end_src

   #+RESULTS:
   : Hi, Tom

